{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "I-ORG",
    "1": "B-LOC",
    "2": "O",
    "3": "B-ORG",
    "4": "I-LOC",
    "5": "I-PER",
    "6": "B-TIME",
    "7": "I-TIME",
    "8": "B-PER"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "I-ORG": 0,
    "B-LOC": 1,
    "O": 2,
    "B-ORG": 3,
    "I-LOC": 4,
    "I-PER": 5,
    "B-TIME": 6,
    "I-TIME": 7,
    "B-PER": 8
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.12.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 21128
}
